# Создание  списка книг со словарями
books = [
{"title": "Война и мир", "Author": "Лев Толстой",  "year": 1869},
{"title": "Гарри Поттер",  "Author":"Джоан Роулинг","year":1997},
{"title": "Дом в котором", "Author": "Мариам Петросян",  "year": 2009},
{"title": "Мятная сказка",  "Author":"Александр Полярный","year":2018},
{"title": "Портрет Дориана Грея", "Author": "Оскар Уальд",  "year": 1936},
]
# Вывод информации о каждой книге
i = 1
for book in books:
    print(f"----------------------- Книга {i} -----------------------") 
    print(f"Название: {book['title']}, Aвтор: {book['Author']},") 
    print(f"-------------------------{book['year']}--------------------------")
    print() #Пустая строка для разделения книг
    i +=1 #Увеличение счетчика  
